app/views/mechanics/show.html.erb

  <% counter = 1 %>
  <% @mechanic.appointments.each do |appointment| %>
    <% flash[appointment.id] = Vehicle.find_by(id: appointment.vehicle_id).user.id %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mechanic_id" = ?  [["mechanic_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    <strong class="label">Year:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:year] %><br>
    <strong class="label">Make:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:make] %><br>
    <strong class="label">Model:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:model] %><br>
    <strong class="label">Plate Number:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:plate] %><br>
    <strong class="label">Oil Type:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:oil_type] %><br>
    <strong>Oil Qua ntity:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:oil_quantity] %> quarts<br>
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <%= form_tag new_payment_path, method: :get do %>
      <%= hidden_field_tag :id, Vehicle.find_by(id: appointment.vehicle_id).user.id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]