app/views/mechanics/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."mechanic_id" = ?  [["mechanic_id", 1]]
---
  __________________________<br>
  <% @mechanic.appointments.each do |appointment| %>

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <strong>Year:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:year] %><br>
    <strong>Make:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:make] %><br>
    <strong>Model:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:model] %><br>
    <strong>Plate Number:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:plate] %><br>
    <strong>Oil Type:</strong>
    <%= Vehicle.find_by(id: appointment.vehicle_id)[:oil_type] %><br>