app/views/mechanics/show.html.erb

  <br><br><strong>Accepted Appointments:</strong><br><br>
  <% @mechanic.appointments.each do |appointment| %>
    <% flash[appointment.id] = Vehicle.find_by(id: appointment.vehicle_id).user.id %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."mechanic_id" = ?  [["mechanic_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    <strong class="label">Year:</strong>
    <span style="float:left;padding-left:155px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:year] %></span><br>
    <strong class="label">Make:</strong>
    <span style="float:left;padding-left:145px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:make] %></span><br>
    <strong class="label">Model:</strong>
    <span style="float:left;padding-left:139px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:model] %></span><br>
    <strong class="label">Plate Number:</strong>
    <span style="float:left;padding-left:83px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:plate] %></span><br>
    <strong class="label">Oil Type:</strong>
    <span style="float:left;padding-left:128px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:oil_type] %></span><br>
    <strong class="label">Oil Quantity:</strong>
    <span style="float:left;padding-left:102px;"><%= Vehicle.find_by(id: appointment.vehicle_id)[:oil_quantity] %> quarts</span><br>
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <%= form_tag new_payment_path, method: :get do %>
      <%= hidden_field_tag :id, Vehicle.find_by(id: appointment.vehicle_id).user.id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]