app/views/users/show.html.erb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."user_id" = ?  [["user_id", 3]]
---
  <strong>Vehicles:</strong>
  <% @user.vehicles.each do |vehicle| %>