app/views/payments/_form.html.erb


  <p>The client is <%= User.find(@user).username %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]


  <p>Your Mechanic is <%= Mechanic.find(@mechanic).name %></p>
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]