app/views/payments/index.html.erb

SELECT "payments".* FROM "payments" WHERE "payments"."user_id" = ?  [["user_id", 2]]
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

    <% @user.payments.each do |payment| %>
      <tr>
        <td><%= Mechanic.find(payment.mechanic_id).name %></td>

SELECT "payments".* FROM "payments" WHERE "payments"."mechanic_id" = ?  [["mechanic_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <tbody>
      <% @mechanic.payments.each do |payment| %>
        <tr>
          <td><%= User.find(payment.user_id).username %></td>