app/views/payments/show.html.erb

  <strong>User:</strong>
  <%= User.find(@payment.user_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  <strong>Mechanic:</strong>
  <%= Mechanic.find(@payment.mechanic_id).name %>
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]