app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT  "appointments".* FROM "appointments" ORDER BY "appointments"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def edit
    @appointment = Appointment.find(params[:id])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("date", "location", "odometer", "vehicle_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2019-02-13 16:49:00"], ["location", "NYC"], ["odometer", 23456], ["vehicle_id", 2], ["created_at", "2019-02-13 16:49:12.851259"], ["updated_at", "2019-02-13 16:49:12.851259"]]

  def update

    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "mechanic_id" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["mechanic_id", 2], ["updated_at", "2019-02-13 19:29:29.494799"], ["id", 2]]