app/controllers/mechanics_controller.rb

  def index
    @mechanics = Mechanic.all
---
SELECT "mechanics".* FROM "mechanics"

  def create
    @mechanic = Mechanic.new(mechanic_params)

    respond_to do |format|
      if @mechanic.save
---
INSERT INTO "mechanics" ("name", "experience", "locaiton", "range", "created_at", "updated_at", "password", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @mechanic.update(mechanic_params)
---
UPDATE "mechanics" SET "experience" = ?, "updated_at" = ? WHERE "mechanics"."id" = ?  [["experience", 6], ["updated_at", "2019-02-11 16:35:58.153825"], ["id", 1]]

  def destroy
    @mechanic.destroy
---
DELETE FROM "mechanics" WHERE "mechanics"."id" = ?  [["id", 1]]

    def set_mechanic
      @mechanic = Mechanic.find(params[:id])
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]