app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
    if session[:user_id]
      @user = User.find(session[:user_id])
    elsif session[:mechanic_id]
      @mechanic = Mechanic.find(session[:mechanic_id])
---
SELECT "payments".* FROM "payments"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit

    @user_id = session[:user_id]
    @mechanic = Mechanic.find_by(id: @payment.mechanic.id).id
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @payment = Payment.new(payment_params)

    respond_to do |format|
      if @payment.save
---
INSERT INTO "payments" ("name_on_card", "card_number", "expiration", "user_id", "mechanic_id", "created_at", "updated_at", "amount") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @payment.update(payment_params)
---
UPDATE "payments" SET "name_on_card" = ?, "card_number" = ?, "expiration" = ?, "security_code" = ?, "updated_at" = ? WHERE "payments"."id" = ?  [["name_on_card", "q"], ["card_number", "1"], ["expiration", "1"], ["security_code", 1], ["updated_at", "2019-02-14 19:04:51.772753"], ["id", 8]]

  def destroy
    @payment.destroy
---
DELETE FROM "payments" WHERE "payments"."id" = ?  [["id", 1]]

    def set_payment
      @payment = Payment.find(params[:id])
---
SELECT  "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]