app/controllers/sessions_controller.rb

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."username" = ? LIMIT ?  [["username", "Kevin"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Kevin"], ["LIMIT", 1]]
---
  def create

   if params[:session][:user_type] == "mechanic"
     session[:mechanic_id] = Mechanic.find_by(name: params[:session][:username]).id
     redirect_to mechanic_path(session[:mechanic_id])

 else

    # logged_in_person = User.find_by_name(params[username]).id || Mechani
    # if logged_in_person.class == User

    session[:user_id] = User.find_by(username: params[:session][:username]).id