app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    session[:user_id] = @user.id
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Peter"], ["password", "1234"], ["image", ""], ["created_at", "2019-02-11 21:13:07.708683"], ["updated_at", "2019-02-11 21:13:07.708683"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5j8ex-DuZtov8FlWyMhzlZqThxgJEavj0igkWcPXcQYrT95Djsg"], ["updated_at", "2019-02-12 21:37:10.928895"], ["id", 2]]