app/controllers/vehicles_controller.rb

INSERT INTO "vehicles" ("year", "make", "model", "plate", "oil_type", "oil_quantity", "created_at", "updated_at", "user_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vehicle = Vehicle.new(vehicle_params)
    respond_to do |format|
      if @vehicle.save

UPDATE "vehicles" SET "image" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?
---
  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)

DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 5]]
---
  def destroy
    @vehicle.destroy