app/views/vehicles/show.html.erb


<% if Appointment.find_by(vehicle_id: @vehicle.id) != nil %>
<%= button_to "My Appointments", appointment_path(Appointment.find_by(vehicle_id: @vehicle.id).id), :method => "get" %>
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."vehicle_id" = ? LIMIT ?  [["vehicle_id", 2], ["LIMIT", 1]]