app/views/appointments/index.html.erb

        <% if appointment.mechanic_id %>
        <td><%= Mechanic.find_by(id: appointment.mechanic_id).name %></td>
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <% end %>
        <td><%= Vehicle.find(appointment.vehicle_id).model %></td>
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]