app/views/appointments/show.html.erb

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <strong>Vehicle:</strong>
  Make: <%= link_to Vehicle.find(@appointment.vehicle_id).model, Vehicle.find(@appointment.vehicle_id) %>