app/views/layouts/_footer.html.erb

<% if session[:mechanic_id] %>
<%= link_to Mechanic.find_by(id: session[:mechanic_id]).name, mechanic_path(session[:mechanic_id]) %>
<% elsif session[:user_id] %>
<%= link_to User.find_by(id: session[:user_id]).username, user_path(session[:user_id]) %>
---
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]