app/views/layouts/_header.html.erb

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<p><% if session[:mechanic_id] %>
<strong>Mechanic name: </strong><%= Mechanic.find_by(id: session[:mechanic_id]).name %>
<% elsif session[:user_id] %>
<strong>Username: </strong><%= User.find_by(id: session[:user_id]).username%>